# SetReadAccessLevel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchemaBuilder..::..SetReadAccessLevel Method
SchemaBuilder Class See Also
---
Sets top level read access (for entities)
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public SchemaBuilder SetReadAccessLevel(
	AccessLevel readAccessLevel
)
```

Visual Basic
---
```text
Public Function SetReadAccessLevel ( _
	readAccessLevel As AccessLevel _
) As SchemaBuilder
```

Visual C++
---
```text
public:
SchemaBuilder^ SetReadAccessLevel(
	AccessLevel readAccessLevel
)
```

# ### Parameters
readAccessLevel
    Type: Autodesk.Revit.DB.ExtensibleStorage..::..AccessLevel Read access level value to be set
# ### Return Value
The SchemaBuilder object may be used to add more settings.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The SchemaBuilder has already finished building the Schema. |

# See Also
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace